app/Views/layout/back-end/main.php

SELECT *
FROM `store`
---
  <meta content="width=device-width, initial-scale=1, maximum-scale=1, shrink-to-fit=no" name="viewport">
  <?php
    $db = db_connect();
    $query = $db->table('store')->getWhere([])->getRow();

SELECT *
FROM `user`
WHERE `id` = '1'
---
            <?php
              $id = session('id');
              $db = db_connect();
              $user = $db->table('user')->getWhere(['id' => $id])->getRow();