app/Views/layout/back-end/sidebar.php

    <?php
        $db = db_connect();
        $request = \Config\Services::request();
        $query = $db->table('store')->getWhere([])->getRow();
---
SELECT *
FROM `store`