app/Controllers/Chat.php

    public function list()
    {
        if ($this->request->isAJAX()) {
            $room_number = $this->request->getVar('room_number');
            $sender_id = $this->request->getVar('sender_id');

            $chat = $this->chat->join('user', 'user.id = message.user_id')
                    ->where('room_number', $room_number)->findAll();

            foreach ($chat as $c) {
                $user_id =  $c['user_id'];
                $recipient_id =  $c['recipient_id'];
                $sender_id =  $c['sender_id'];
            }

            $user = $this->user->find($user_id);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '2'

    public function send()
    {
        $user_id = $this->request->getVar('user_id');
        $room_number = $this->request->getVar('room_number');
        $message = $this->request->getVar('message');

        $params = [
            'room_number'   => $room_number,
            'user_id'       => $user_id,
            'sender_id'     => session('id'),
            'recipient_id'  => $user_id,
            'message'       => $message,
            'time'          => Time::now('Asia/Jakarta', 'en_ID'),
        ];

        $this->chat->insert($params);

        $message = $this->chat->groupBy('id')->orderBy('id', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `message`
GROUP BY `id`
ORDER BY `id` ASC

            'time_in'       => Time::now('Asia/Jakarta', 'en_ID'),
        ];

        $this->db->table('message_latest')->where(['user_id' => $user_id])->update($latest_params);
---
UPDATE `message_latest` SET `user_id` = '2', `message_id` = '21', `time_in` = '2022-07-28 16:03:01'
WHERE `user_id` = '2'