app/Controllers/Dashboard.php

SELECT *
FROM `product`
SELECT *
FROM `discount`
SELECT *
FROM `user`
WHERE `level` = 'user'
---
    public function index()
    {
        $data = [
            'title'         => 'Dashboard',
            'product'       => $this->product->get()->getNumRows(),
            'brand'         => $this->brand->get()->getNumRows(),
            'discount'      => $this->discount->get()->getNumRows(),
            'category'      => $this->category->get()->getNumRows(),
            'costumer'      => $this->costumer->where('level', 'user')->get()->getNumRows(),