app/Controllers/Discount.php

    public function index()
    {
        $data = [
            'title' => 'Diskon',
            'discount' => $this->discount->findAll()
---
SELECT *
FROM `discount`