app/Controllers/Home.php

SELECT `order_product`.*, `product`.`name`, `product`.`image`
FROM `order_product`
JOIN `product` ON `product`.`id` = `order_product`.`product_id`
WHERE `user_id` = '2'
---
    public function orderAccepted()
    {
        $data = [
            'order' => $this->order->select('order_product.*, product.name, product.image')
                ->join('product', 'product.id = order_product.product_id')
                ->where('user_id', session('id'))->get()->getResultArray()
        ];