app/Controllers/Order.php

    public function detailOrderIn($id)
    {
        if ($id != null) {
            $query = $this->db->table('order_items')
                                ->join('order_details', 'order_details.id = order_items.order_id')
                                ->join('user', 'user.id = order_details.user_id')
                                ->join('product', 'product.id = order_items.product_id')
                                ->join('order_delivery', 'order_delivery.id = order_details.delivery_id')
                                ->join('payment_details', 'payment_details.id = order_details.payment_id')
                                ->join('user_address', 'user_address.id = user.id')
                                ->getWhere(['order_items_id' => $id]);

            if ($query->resultID->num_rows > 0) {
                $data = [
                    'title' => 'Detail Orderan Masuk',
                    'order' => $query->getRow(),
                ];
---
SELECT *
FROM `user`