app/Controllers/Product.php

    public function add()
    {
        $data = [
            'title' => 'Tambah Produk',
            'category' => $this->category->findAll(),
            'discount' => $this->discount->findAll(),
---
SELECT *
FROM `discount`