app/Models/ChatModel.php

    function getAll()
    {
        $builder = $this->db->table('message');
        $builder->join('user', 'user.id = message.sender_id');
        $builder->orderBy('time', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `message`
JOIN `user` ON `user`.`id` = `message`.`sender_id`
ORDER BY `time` ASC

    function getList()
    {
        $builder = $this->db->table('message');
        $builder->join('user', 'user.id = message.sender_id');
        $builder->where('sender_id != 1');
        $builder->groupBy('first_name');
        $builder->orderBy('time', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `message`
JOIN `user` ON `user`.`id` = `message`.`sender_id`
WHERE `sender_id` != 1
GROUP BY `first_name`
ORDER BY `time` DESC