app/Models/OrderModel.php

    function getAll()
    {
        $builder = $this->db->table('order_items');
        $builder->join('order_details', 'order_details.id = order_items.order_id');
        $builder->join('user', 'user.id = order_details.user_id');
        $builder->join('product', 'product.id = order_items.product_id');
        $builder->join('order_delivery', 'order_delivery.id = order_details.delivery_id');
        $builder->join('payment_details', 'payment_details.id = order_details.payment_id');
        $builder->join('user_address', 'user_address.id = user.id');
        $query = $builder->get();
---
SELECT *
FROM `order_items`
JOIN `order_details` ON `order_details`.`id` = `order_items`.`order_id`
JOIN `user` ON `user`.`id` = `order_details`.`user_id`
JOIN `product` ON `product`.`id` = `order_items`.`product_id`
JOIN `order_delivery` ON `order_delivery`.`id` = `order_details`.`delivery_id`
JOIN `payment_details` ON `payment_details`.`id` = `order_details`.`payment_id`
JOIN `user_address` ON `user_address`.`id` = `user`.`id`