app/Models/ProductModel.php

    function getAll()
    {
        $builder = $this->db->table('product');
        $builder->join('product_category', 'product_category.id = product.category_id');
        $builder->join('discount', 'discount.id = product.discount_id');
        $query = $builder->get();
---
SELECT *
FROM `product`
JOIN `product_category` ON `product_category`.`category_id` = `product`.`category_id`
JOIN `discount` ON `discount`.`discount_id` = `product`.`discount_id`